Tekla Open API Reference for Tekla Structures 2025
AnalysisModelSpectrumProperties.SpectrumDampingPointID Property
 The list of the damping point identifiers of the spectrum.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<Identifier> SpectrumDampingPointID { get; set; }
Public Property SpectrumDampingPointID As List(Of Identifier)
	Get
	Set
Property Value
Type: List<Identifier>
See Also
Reference
AnalysisModelSpectrumProperties Class
Tekla.Structures.Analysis Namespace